{
  "name": "Giulio Luzzati",
  "tagline": "DSP Engineering Lead · Embedded Systems · ML/Algorithms · Data Pipelines",
  "tagline_impact" : "DSP Team Leader · Prototype to Production · Algorithm Design · System Integration",
  "tagline_generic" : "DSP Engineering Lead · Real-time Systems · Algorithm Design · Team Leadership",
  "title": "Ph.D.",
  "location": "Cambridge, UK",
  "email": "giulio.luzzati@live.it",
  "linkedin": "/in/giulio-luzzati-9bb79245",
  "github": "giulioluzzati",
  "phone": "+447397791131",
  "summary": "Engineering lead specializing in real-time signal processing and data pipelines. I design and implement DSP algorithms with a focus on embedded systems, ensuring they perform reliably from prototype to production. I extract insights from complex and noisy sensor data. My technical background is full-stack, spanning embedded C development to cloud computing.",
  "keywords": {
    "stack": ["Python", "MATLAB", "C", "Docker", "PyTorch", "FastAPI"],
    "core": ["Signal Processing", "Machine Learning", "CI/CD", "Embedded Systems", "Real-time", "DSP", "Algorithms", "Data Pipelines", "ARM MCU", "Microservices"]
  },
  "experience": [
    {
      "company": "Cambridge Touch Technologies",
      "location": "Cambridge, UK",
      "description": "CTT is a tech startup developing innovative cost-effective touch-pressure sensing for display and non-display surfaces.",
      "roles": [
        {
          "title": "DSP Team Leader",
          "period": "Jan 2022 - Present",
          "keywords": [],
          "achievements": [
            "Lead cross-functional collaboration between algorithm, hardware, and firmware teams for system integration",
            "Designed algorithms for novel sensor types (inferring input location from multidimensional pressure sensor data) and delivered full real-time demo software platform",
            "Provide accurate insights from large datasets of sensor data. Design metrics and procedures for evaluating sensor performance to drive improvement of sensor design", 
            "Built bespoke data pipeline framework for reproducible, version-controlled analysis across sensor iterations, with heterogeneous data sources and processing scripts",
            "Exploration of ML approaches as alternative to traditional DSP algorithms. PyTorch/Lightning, cloud GPU infrastructure"
          ]
        },
        {
          "title": "Principal DSP Engineer",
          "period": "Jul 2021 - Dec 2021",
          "keywords": [],
          "achievements": [
            "Real-time Python demos and visualization tools using Arcade library to demonstrate algorithms and technology potential",
            "Designed and built a firmware release and provisioning system: a REST API that assembles versioned binaries, calibration data, and memory-aware flashing scripts from CI-managed artifacts, automatically tailored per device.", 
            "Built ARM MCU simulation environment, harnessing ARM's cycle accurate models to provide a framework to run experiments at scale for profiling C code routines, for several (M0, M32, M4 and M55) platforms"
          ]
        },
        {
          "title": "Senior DSP Engineer",
          "period": "Oct 2018 - Jun 2021",
          "keywords": [],
          "achievements": [
            "Designed (Matlab) and implemented (embedded C) algorithms for real-time signal processing on resource-constrained devices",
            "Established comprehensive CI/CD infrastructure using GitLab and Docker, improving code quality and deployment efficiency"
          ]
        }
      ]
    },
    {
      "company": "5G Innovation Centre",
      "location": "Guildford, UK",
      "description": "The 5GIC is a research centre within the University of Surrey, with one of the largest 5G testbeds in the UK, and research and standardisation activity in close partnership with some of the largest players in the field.",
      "roles": [
        {
          "title": "Research Software Engineer",
          "period": "Oct 2017 - Oct 2018",
          "achievements": [
            "At the 5GIC I was part of the core network team. I worked on and extended the core network code base to enable demonstrating proof of concepts for 5G features."
          ]
        }
      ]
    },
    {
      "company": "Akya",
      "location": "Swindon, UK",
      "description": "AKYA's core business was a novel \"dynamically reconfigurable logic\" approach to hardware design, for low power/low cost applications, unlike e.g. FPGA, providing \"just enough\" reconfigurability to meet design requirements.",
      "roles": [
        {
          "title": "DSP Software Engineer",
          "period": "Nov 2016 - Oct 2017",
          "achievements": [
            "At AKYA I contributed as a software engineer to the codebase of a framework to synthesise logic from a high-level description of the hardware. My role was to design and develop algorithms and software components that expand and integrate the existing framework, as well as creating tools for testing and data visualization"
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "degree": "Ph.D. in Computer Science",
      "institution": "University of Genova",
      "location": "Genova, Italy",
      "year": "2016",
      "details": "Research topics: joint channel/source coding in communication networks, image data hiding, audio fingerprinting"
    },
    {
      "degree": "M.Sc. in Telecommunication Engineering",
      "institution": "University of Genova",
      "location": "Genova, Italy",
      "year": "2012"
    }
  ],
  "certifications": [
    {
      "title": "Italian State Board Examination for Professional Engineering License",
      "year": "2012"
    }
  ],
  "technical_ventures": [
    {
      "company": "DesignPilot.cc",
      "location": "",
      "description": "DesignPilot is an AI-powered tool that streamlines product design validation using LLMs, helping teams efficiently evaluate and refine product concepts.\nSupporting business strategy with technical insights in exchange for equity",
      "roles": [
        {
          "title": "Founding Engineer",
          "period": "Oct 2024 - Present",
          "achievements": [
            "Architected and implemented a production-ready FastAPI backend from proof-of-concept code, creating a scalable platform for AI-powered design validation",
            "Designed comprehensive API system with Supabase integration, incorporating user authentication and Stripe payment processing",
            "Applied machine learning expertise to enhance product validation workflows using large language models"
          ]
        }
      ]
    }
  ]
} 